Tekla Open API Reference for Tekla Structures 2025
AlongLineOrWithLeaderLinePlacingType Class
 The AlongLineOrWithLeaderLinePlacingType class defines a placing type that places the object using the along line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.AlongLineOrWithLeaderLinePlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class AlongLineOrWithLeaderLinePlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class AlongLineOrWithLeaderLinePlacingType
	Inherits PreferredPlacingTypeBase
The AlongLineOrWithLeaderLinePlacingType type exposes the following members.
Constructors
Name | Description
AlongLineOrWithLeaderLinePlacingType
 Creates a new along line or with leader line placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace